export default [
    {
        id: 1,
        name: 'Данный сайт-портфолио',
        framework: 'React.js',
        done: true,
        shortDesc: '',
        desc: ''
    },
    {
        id: 2,
        name: 'Raider IO API Vue.js',
        framework: 'Vue.js',
        done: false,
        shortDesc: 'Проект для отслеживания статистики персонажа в World of Warcraft',
        desc: 'Проект создается с помощью Vue.js, имеет адаптивную верстку, написана первая вертикальная навигационная адаптивная панель, а так же работа с асинхронными запросами'
    },
    {
        id: 3,
        name: 'Rick and Morty API Vue.js',
        framework: 'Vue.js',
        done: true,
        shortDesc: 'Первый проект, разработанный с помощью Vue.js',
        desc: 'Проект реализован с помощью Vue.js, имеет адаптивную верстку, усовершенстованную навигационную панель, получение данных с помощью сервиса Rick and Morty API'
    },

    {
        id: 4,
        name: 'ToDo List',
        framework: 'React.js',
        done: true,
        shortDesc: 'То, с чего начинают путь юные разработчики',
        desc: 'Проект реализован с помощью React.js, имеет адаптивную верстку, присутствует возможность сохранения данных в браузере, а так же функция "Drag and Drop"'
    },
    {
        id: 5,
        name: 'Norylord Task Board',
        framework: 'React.js',
        done: true,
        shortDesc: 'Большой шаг в работе с Drag and Drop',
        desc: 'Проект позволяет создавать собственные доски, размещать и редактировать задачи. Так же задачи можно переносить с одной доски на другую с помощью функции "Drag and Drop"'
    },
    {
        id: 6,
        name: 'Форма создания товаров',
        framework: 'React.js',
        done: true,
        shortDesc: 'Первый проект, основанный на Next.js и React',
        desc: 'Проект позволяет создавать карточки товаров, присутствует валидация формы, сохранение товаров в локальном хранилище, так же реализовано удаление товаров'
    },
    {
        id: 7,
        name: 'Rick and Morty',
        framework: 'React.js',
        done: true,
        shortDesc: 'Первый проект, разработанный с помощью React.js',
        desc: 'Проект реализован с помощью React.js, имеет адаптивную верстку, получение данных с помощью сервиса Rick and Morty API'
    },
    {
        id: 8,
        name: 'Проект для хакатона "Цифровой прорыв"',
        framework: 'React Native',
        done: true,
        shortDesc: 'Мобильное приложения для "Умных городов"',
        desc: 'Проект содержит несколько экранов, на которых отображаются новости, прямые эфиры, сообщения, фильтры для видов спорта, а так же профиль пользователя'
    },
    {
        id: 9,
        name: 'Сайт портфолио',
        framework: 'React.js',
        done: true,
        shortDesc: 'Сайтов портфолио много не бывает :)',
        desc: 'Сайт реализован с помощью фреймворка Next.js, присутствует работа с графиками, незначительные анимации, а так же немного информации обо мне.'
    },
]